yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8s208sb.h
#define CAN_MCR_INRQ             CAN_MCR_bit.INRQ
#define CAN_MCR_SLEEP            CAN_MCR_bit.SLEEP
#define CAN_MCR_TXFP             CAN_MCR_bit.TXFP
#define CAN_MCR_RFLM             CAN_MCR_bit.RFLM
#define CAN_MCR_NART             CAN_MCR_bit.NART
#define CAN_MCR_AWUM             CAN_MCR_bit.AWUM
#define CAN_MCR_ABOM             CAN_MCR_bit.ABOM
#define CAN_MCR_TTOM             CAN_MCR_bit.TTOM

#define CAN_MSR_INAK             CAN_MSR_bit.INAK
#define CAN_MSR_SLAK             CAN_MSR_bit.SLAK
#define CAN_MSR_ERRI             CAN_MSR_bit.ERRI
#define CAN_MSR_WKUI             CAN_MSR_bit.WKUI
#define CAN_MSR_TX               CAN_MSR_bit.TX
#define CAN_MSR_RX               CAN_MSR_bit.RX

#define CAN_TSR_RQCP0            CAN_TSR_bit.RQCP0
#define CAN_TSR_RQCP1            CAN_TSR_bit.RQCP1
#define CAN_TSR_RQCP2            CAN_TSR_bit.RQCP2
#define CAN_TSR_TXQOK0           CAN_TSR_bit.TXQOK0
#define CAN_TSR_TXQOK1           CAN_TSR_bit.TXQOK1
#define CAN_TSR_TXQOK2           CAN_TSR_bit.TXQOK2

#define CAN_TPR_CODE0            CAN_TPR_bit.CODE0
#define CAN_TPR_CODE1            CAN_TPR_bit.CODE1
#define CAN_TPR_TME0             CAN_TPR_bit.TME0
#define CAN_TPR_TME1             CAN_TPR_bit.TME1
#define CAN_TPR_TME2             CAN_TPR_bit.TME2
#define CAN_TPR_LOW0             CAN_TPR_bit.LOW0
#define CAN_TPR_LOW1             CAN_TPR_bit.LOW1
#define CAN_TPR_LOW2             CAN_TPR_bit.LOW2

#define CAN_RFR_FMP              CAN_RFR_bit.FMP
#define CAN_RFR_FULL             CAN_RFR_bit.FULL
#define CAN_RFR_FOVR             CAN_RFR_bit.FOVR
#define CAN_RFR_RFOM             CAN_RFR_bit.RFOM

#define CAN_IER_TMEIE            CAN_IER_bit.TMEIE
#define CAN_IER_FMPIE            CAN_IER_bit.FMPIE
#define CAN_IER_FFIE             CAN_IER_bit.FFIE
#define CAN_IER_FOVIE            CAN_IER_bit.FOVIE
#define CAN_IER_WKUIE            CAN_IER_bit.WKUIE

#define CAN_DGR_LBKM             CAN_DGR_bit.LBKM
#define CAN_DGR_SILM             CAN_DGR_bit.SILM
#define CAN_DGR_SAMP             CAN_DGR_bit.SAMP
#define CAN_DGR_RX               CAN_DGR_bit.RX
#define CAN_DGR_TXM2E            CAN_DGR_bit.TXM2E

#define CAN_ESR_EWGF             CAN_ESR_bit.EWGF
#define CAN_ESR_EPVF             CAN_ESR_bit.EPVF
#define CAN_ESR_BOFF             CAN_ESR_bit.BOFF
#define CAN_ESR_LEC0             CAN_ESR_bit.LEC0
#define CAN_ESR_LEC1             CAN_ESR_bit.LEC1
#define CAN_ESR_LEC2             CAN_ESR_bit.LEC2

#define CAN_EIER_EWGIE           CAN_EIER_bit.EWGIE
#define CAN_EIER_EPVIE           CAN_EIER_bit.EPVIE
#define CAN_EIER_BOFIE           CAN_EIER_bit.BOFIE
#define CAN_EIER_LECIE           CAN_EIER_bit.LECIE
#define CAN_EIER_ERRIE           CAN_EIER_bit.ERRIE

#endif

/*-------------------------------------------------------------------------
 *      beCAN bit masks
 *-----------------------------------------------------------------------*/
#define MASK_CAN_MCR_INRQ        0x01
#define MASK_CAN_MCR_SLEEP       0x02
#define MASK_CAN_MCR_TXFP        0x04
#define MASK_CAN_MCR_RFLM        0x08
#define MASK_CAN_MCR_NART        0x10
#define MASK_CAN_MCR_AWUM        0x20
#define MASK_CAN_MCR_ABOM        0x40
#define MASK_CAN_MCR_TTOM        0x80

#define MASK_CAN_MSR_INAK        0x01
#define MASK_CAN_MSR_SLAK        0x02
#define MASK_CAN_MSR_ERRI        0x04
#define MASK_CAN_MSR_WKUI        0x08
#define MASK_CAN_MSR_TX          0x10
#define MASK_CAN_MSR_RX          0x20

#define MASK_CAN_TSR_RQCP0       0x01
#define MASK_CAN_TSR_RQCP1       0x02
#define MASK_CAN_TSR_RQCP2       0x04
#define MASK_CAN_TSR_TXQOK0      0x10
#define MASK_CAN_TSR_TXQOK1      0x20
#define MASK_CAN_TSR_TXQOK2      0x40

#define MASK_CAN_TPR_CODE0       0x01
#define MASK_CAN_TPR_CODE1       0x02
#define MASK_CAN_TPR_TME0        0x04
#define MASK_CAN_TPR_TME1        0x08
#define MASK_CAN_TPR_TME2        0x10
#define MASK_CAN_TPR_LOW0        0x20
#define MASK_CAN_TPR_LOW1        0x40
#define MASK_CAN_TPR_LOW2        0x80

#define MASK_CAN_RFR_FMP         0x03
#define MASK_CAN_RFR_FULL        0x08
#define MASK_CAN_RFR_FOVR        0x10
#define MASK_CAN_RFR_RFOM        0x20

#define MASK_CAN_IER_TMEIE       0x01
#define MASK_CAN_IER_FMPIE       0x02
#define MASK_CAN_IER_FFIE        0x04
#define MASK_CAN_IER_FOVIE       0x10
#define MASK_CAN_IER_WKUIE       0x80

#define MASK_CAN_DGR_LBKM        0x01
#define MASK_CAN_DGR_SILM        0x02
#define MASK_CAN_DGR_SAMP        0x04
#define MASK_CAN_DGR_RX          0x08
#define MASK_CAN_DGR_TXM2E       0x10

#define MASK_CAN_ESR_EWGF        0x01
#define MASK_CAN_ESR_EPVF        0x02
#define MASK_CAN_ESR_BOFF        0x04
#define MASK_CAN_ESR_LEC0        0x10
#define MASK_CAN_ESR_LEC1        0x20
#define MASK_CAN_ESR_LEC2        0x40

#define MASK_CAN_EIER_EWGIE      0x01
#define MASK_CAN_EIER_EPVIE      0x02
#define MASK_CAN_EIER_BOFIE      0x04
#define MASK_CAN_EIER_LECIE      0x10
#define MASK_CAN_EIER_ERRIE      0x80


/*-------------------------------------------------------------------------
 *      CPU register definitions
 *-----------------------------------------------------------------------*/
/* Accumulator */
__IO_REG8    (CPU_A,       0x7F00, __READ_WRITE);
/* Program counter extended */
__IO_REG8    (CPU_PCE,     0x7F01, __READ_WRITE);
/* Program counter high */
__IO_REG8    (CPU_PCH,     0x7F02, __READ_WRITE);
/* Program counter low */
__IO_REG8    (CPU_PCL,     0x7F03, __READ_WRITE);
/* X index register high */
__IO_REG8    (CPU_XH,      0x7F04, __READ_WRITE);
/* X index register low */
__IO_REG8    (CPU_XL,      0x7F05, __READ_WRITE);
/* Y index register high */
__IO_REG8    (CPU_YH,      0x7F06, __READ_WRITE);
/* Y index register low */
__IO_REG8    (CPU_YL,      0x7F07, __READ_WRITE);
/* Stack pointer high */
__IO_REG8    (CPU_SPH,     0x7F08, __READ_WRITE);
/* Stack pointer low */
__IO_REG8    (CPU_SPL,     0x7F09, __READ_WRITE);
/* Condition code register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char C           : 1;
  unsigned char Z           : 1;
  unsigned char NF          : 1;
  unsigned char I0          : 1;
  unsigned char H           : 1;
  unsigned char I1          : 1;
  unsigned char             : 1;
  unsigned char V           : 1;
} __BITS_CPU_CCR;
#endif
__IO_REG8_BIT(CPU_CCR,     0x7F0A, __READ_WRITE, __BITS_CPU_CCR);

